Tekla.Structures.Analysis.AnalysisCompositeBeam
The AnalysisCompositeBeam class contains information related to analysis composite beams.

Tekla.Structures.Analysis.AnalysisCompositeBeam._Composite
This indicates if the beam is composite.

Tekla.Structures.Analysis.AnalysisCompositeBeam._SlabMaterial
The slab material of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam._SlabThickness
The thickness of the slab of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam._SlabWidthLeft
The left width of the slab of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam._SlabWidthRight
The right width of the slab of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam._ConcreteStrength
The strength of the conrete of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam._RibHeight
The height of the rib of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam._RibWidth
The width of the rib of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam._RibDirection
The direction of the rib of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam._StudDiameter
The diameter of the stud of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam._StudLength
The length of the stud of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam.Composite
Indicates whether the beam is composite.

Tekla.Structures.Analysis.AnalysisCompositeBeam.SlabMaterial
The slab material of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam.SlabThickness
The thickness of the slab of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam.SlabWidthLeft
The left width of the slab of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam.SlabWidthRight
The right width of the slab of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam.ConcreteStrength
The strength of the concrete of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam.RibHeight
The height of the rib of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam.RibWidth
The width of the rib of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam.RibDirection
The direction of the rib of the analysis composite beam (in the global coordinate system).

Tekla.Structures.Analysis.AnalysisCompositeBeam.StudDiameter
The diameter of the stud of the analysis composite beam.

Tekla.Structures.Analysis.AnalysisCompositeBeam.StudLength
The length of the stud of the analysis composite beam.